Revit 2024 API
MEPCurveType.RoutingPreferenceManager Property
 The RoutingPreferenceManager for the MEPCurveType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RoutingPreferenceManager RoutingPreferenceManager { get; }
Visual Basic
Public ReadOnly Property RoutingPreferenceManager As RoutingPreferenceManager
	Get
Visual C++
public:
property RoutingPreferenceManager^ RoutingPreferenceManager {
	RoutingPreferenceManager^ get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
MEPCurveType Class
Autodesk.Revit.DB Namespace